---
title: AnalyticalLink
classe: Autodesk.Revit.DB.Structure.AnalyticalLink
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# AnalyticalLink

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ End { get; }` | `analyticalLink.End` | XYZ |
| `ElementId EndHubId { get; }` | `analyticalLink.EndHubId` | ElementId |
| `ElementId OwnerId { get; }` | `analyticalLink.OwnerId` | ElementId |
| `XYZ Start { get; }` | `analyticalLink.Start` | XYZ |
| `ElementId StartHubId { get; }` | `analyticalLink.StartHubId` | ElementId |
| `AnalyticalLink Create(Document, ElementId, ElementId, ElementId)` | `AnalyticalLink.Create(doc, type, startHubId, endHubId)` | AnalyticalLink |
| `Boolean IsAutoGenerated()` | `analyticalLink.IsAutoGenerated()` | Boolean |
| `Boolean IsValidHub(Document, ElementId)` | `AnalyticalLink.IsValidHub(doc, hubId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```